SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFM32PG28/Include/efm32pg28b200f512im68.h
#define __CM33_REV          0x0004U /**< Cortex-M33 Core revision */
#define __DSP_PRESENT           1U /**< Presence of DSP  */
#define __FPU_PRESENT           1U /**< Presence of FPU  */
#define __MPU_PRESENT           1U /**< Presence of MPU  */
#define __SAUREGION_PRESENT     1U /**< Presence of FPU  */
#define __TZ_PRESENT            1U /**< Presence of TrustZone */
#define __VTOR_PRESENT          1U /**< Presence of VTOR register in SCB  */
#define __NVIC_PRIO_BITS        4U /**< NVIC interrupt priority bits */
#define __Vendor_SysTickConfig  0U /**< Is 1 if different SysTick counter is used */

/** @} End of group EFM32PG28B200F512IM68_Core */

/**************************************************************************//**
* @defgroup EFM32PG28B200F512IM68_Part EFM32PG28B200F512IM68 Part
* @{
******************************************************************************/

/** Part number */

/* If part number is not defined as compiler option, define it */
#if !defined(EFM32PG28B200F512IM68)
#define EFM32PG28B200F512IM68    1 /**< FULL Part */
#endif

/** Configure part number */
#define PART_NUMBER               "EFM32PG28B200F512IM68" /**< Part Number */

/** Family / Line / Series / Config */
#define _EFM32_PEARL_FAMILY                   1      /** Device Family Name Identifier */
#define _EFM32_PG_FAMILY                      1      /** Device Family Identifier */
#define _EFM_DEVICE                           1      /** Product Line Identifier */
#define _SILICON_LABS_32B_SERIES_2                   /** Product Series Identifier */
#define _SILICON_LABS_32B_SERIES              2      /** Product Series Identifier */
#define _SILICON_LABS_32B_SERIES_2_CONFIG_8          /** Product Config Identifier */
#define _SILICON_LABS_32B_SERIES_2_CONFIG     8      /** Product Config Identifier */
#define _SILICON_LABS_GECKO_INTERNAL_SDID 235    /** Silicon Labs internal use only */
#define _SILICON_LABS_GECKO_INTERNAL_SDID_235        /** Silicon Labs internal use only */
#define _SILICON_LABS_SECURITY_FEATURE_SE 0        /** Mid */
#define _SILICON_LABS_SECURITY_FEATURE_VAULT 1        /** High */
#define _SILICON_LABS_SECURITY_FEATURE_ROT 2        /** Root of Trust */
#define _SILICON_LABS_SECURITY_FEATURE _SILICON_LABS_SECURITY_FEATURE_VAULT /** Security feature set */
#define _SILICON_LABS_DCDC_FEATURE_NOTUSED 0 /** Not Used */
#define _SILICON_LABS_DCDC_FEATURE_DCDC_BUCK 1 /** Includes Buck DCDC */
#define _SILICON_LABS_DCDC_FEATURE_DCDC_BOOST 2 /** Includes Boost DCDC */
#define _SILICON_LABS_DCDC_FEATURE_DCDC_BOB 3 /** Includes Buck or Boost DCDC */
#define _SILICON_LABS_DCDC_FEATURE _SILICON_LABS_DCDC_FEATURE_DCDC_BUCK/** DCDC feature set */
#define _SILICON_LABS_EFR32_RADIO_NONE 0 /** No radio present */
#define _SILICON_LABS_EFR32_RADIO_SUBGHZ 1 /** Radio supports Sub-GHz */
#define _SILICON_LABS_EFR32_RADIO_2G4HZ 2 /** Radio supports 2.4 GHz */
#define _SILICON_LABS_EFR32_RADIO_DUALBAND 3 /** Radio supports dual band */
#define _SILICON_LABS_EFR32_RADIO_TYPE _SILICON_LABS_EFR32_RADIO_NONE/** Radio type */

/** Memory Base addresses and limits */
#define FLASH_MEM_BASE            (0x08000000UL) /** FLASH_MEM base address */
#define FLASH_MEM_SIZE            (0x00100000UL) /** FLASH_MEM available address space */
#define FLASH_MEM_END             (0x080FFFFFUL) /** FLASH_MEM end address */
#define FLASH_MEM_BITS            (0x15UL) /** FLASH_MEM used bits */
#define MSC_FLASH_MEM_BASE        (0x08000000UL) /** MSC_FLASH_MEM base address */
#define MSC_FLASH_MEM_SIZE        (0x00100000UL) /** MSC_FLASH_MEM available address space */
#define MSC_FLASH_MEM_END         (0x080FFFFFUL) /** MSC_FLASH_MEM end address */
#define MSC_FLASH_MEM_BITS        (0x15UL) /** MSC_FLASH_MEM used bits */
#define MSC_FLASH_USERDATA_MEM_BASE (0x0FE00000UL) /** MSC_FLASH_USERDATA_MEM base address */
#define MSC_FLASH_USERDATA_MEM_SIZE (0x00000400UL) /** MSC_FLASH_USERDATA_MEM available address space */
#define MSC_FLASH_USERDATA_MEM_END (0x0FE003FFUL) /** MSC_FLASH_USERDATA_MEM end address */
#define MSC_FLASH_USERDATA_MEM_BITS (0xBUL) /** MSC_FLASH_USERDATA_MEM used bits */
#define USERDATA_BASE             (0x0FE00000UL) /** USERDATA base address */
#define USERDATA_SIZE             (0x00000400UL) /** USERDATA available address space */
#define USERDATA_END              (0x0FE003FFUL) /** USERDATA end address */
#define USERDATA_BITS             (0xBUL) /** USERDATA used bits */
#define MSC_FLASH_DEVINFO_MEM_BASE (0x0FE08000UL) /** MSC_FLASH_DEVINFO_MEM base address */
#define MSC_FLASH_DEVINFO_MEM_SIZE (0x00000400UL) /** MSC_FLASH_DEVINFO_MEM available address space */
#define MSC_FLASH_DEVINFO_MEM_END (0x0FE083FFUL) /** MSC_FLASH_DEVINFO_MEM end address */
#define MSC_FLASH_DEVINFO_MEM_BITS (0xBUL) /** MSC_FLASH_DEVINFO_MEM used bits */
#define MSC_FLASH_CHIPCONFIG_MEM_BASE (0x0FE08400UL) /** MSC_FLASH_CHIPCONFIG_MEM base address */
#define MSC_FLASH_CHIPCONFIG_MEM_SIZE (0x00000600UL) /** MSC_FLASH_CHIPCONFIG_MEM available address space */
#define MSC_FLASH_CHIPCONFIG_MEM_END (0x0FE089FFUL) /** MSC_FLASH_CHIPCONFIG_MEM end address */
#define MSC_FLASH_CHIPCONFIG_MEM_BITS (0xBUL) /** MSC_FLASH_CHIPCONFIG_MEM used bits */
#define DMEM_RAM0_RAM_MEM_BASE    (0x20000000UL) /** DMEM_RAM0_RAM_MEM base address */
#define DMEM_RAM0_RAM_MEM_SIZE    (0x00040000UL) /** DMEM_RAM0_RAM_MEM available address space */
#define DMEM_RAM0_RAM_MEM_END     (0x2003FFFFUL) /** DMEM_RAM0_RAM_MEM end address */
#define DMEM_RAM0_RAM_MEM_BITS    (0x13UL) /** DMEM_RAM0_RAM_MEM used bits */
#define RAM_MEM_BASE              (0x20000000UL) /** RAM_MEM base address */
#define RAM_MEM_SIZE              (0x00040000UL) /** RAM_MEM available address space */
#define RAM_MEM_END               (0x2003FFFFUL) /** RAM_MEM end address */
#define RAM_MEM_BITS              (0x13UL) /** RAM_MEM used bits */

/** Flash and SRAM limits for EFM32PG28B200F512IM68 */
#define FLASH_BASE                (0x08000000UL) /**< Flash Base Address */
#define FLASH_SIZE                (0x00080000UL) /**< Available Flash Memory */
#define FLASH_PAGE_SIZE           (0x00002000UL) /**< Flash Memory page size */
#define SRAM_BASE                 (0x20000000UL) /**< SRAM Base Address */
#define SRAM_SIZE                 (0x00020000UL) /**< Available SRAM Memory */
#define DMA_CHAN_COUNT            LDMA_CH_NUM    /**< Number of DMA channels */
#define EXT_IRQ_COUNT             79             /**< Number of External (NVIC) interrupts */

