SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFM32PG28/Include/efm32pg28b200f512im68.h
/* GPIO Avalibility Info */
#define GPIO_PA_INDEX 0U /**< Index of port PA */
#define GPIO_PA_COUNT 15U /**< Number of pins on port PA */
#define GPIO_PA_MASK  (0x7FFFUL) /**< Port PA pin mask */
#define GPIO_PA_PIN0 1U /**< GPIO pin PA0 is present. */
#define GPIO_PA_PIN1 1U /**< GPIO pin PA1 is present. */
#define GPIO_PA_PIN2 1U /**< GPIO pin PA2 is present. */
#define GPIO_PA_PIN3 1U /**< GPIO pin PA3 is present. */
#define GPIO_PA_PIN4 1U /**< GPIO pin PA4 is present. */
#define GPIO_PA_PIN5 1U /**< GPIO pin PA5 is present. */
#define GPIO_PA_PIN6 1U /**< GPIO pin PA6 is present. */
#define GPIO_PA_PIN7 1U /**< GPIO pin PA7 is present. */
#define GPIO_PA_PIN8 1U /**< GPIO pin PA8 is present. */
#define GPIO_PA_PIN9 1U /**< GPIO pin PA9 is present. */
#define GPIO_PA_PIN10 1U /**< GPIO pin PA10 is present. */
#define GPIO_PA_PIN11 1U /**< GPIO pin PA11 is present. */
#define GPIO_PA_PIN12 1U /**< GPIO pin PA12 is present. */
#define GPIO_PA_PIN13 1U /**< GPIO pin PA13 is present. */
#define GPIO_PA_PIN14 1U /**< GPIO pin PA14 is present. */
#define GPIO_PB_INDEX 1U /**< Index of port PB */
#define GPIO_PB_COUNT 8U /**< Number of pins on port PB */
#define GPIO_PB_MASK  (0x00FFUL) /**< Port PB pin mask */
#define GPIO_PB_PIN0 1U /**< GPIO pin PB0 is present. */
#define GPIO_PB_PIN1 1U /**< GPIO pin PB1 is present. */
#define GPIO_PB_PIN2 1U /**< GPIO pin PB2 is present. */
#define GPIO_PB_PIN3 1U /**< GPIO pin PB3 is present. */
#define GPIO_PB_PIN4 1U /**< GPIO pin PB4 is present. */
#define GPIO_PB_PIN5 1U /**< GPIO pin PB5 is present. */
#define GPIO_PB_PIN6 1U /**< GPIO pin PB6 is present. */
#define GPIO_PB_PIN7 1U /**< GPIO pin PB7 is present. */
#define GPIO_PC_INDEX 2U /**< Index of port PC */
#define GPIO_PC_COUNT 12U /**< Number of pins on port PC */
#define GPIO_PC_MASK  (0x0FFFUL) /**< Port PC pin mask */
#define GPIO_PC_PIN0 1U /**< GPIO pin PC0 is present. */
#define GPIO_PC_PIN1 1U /**< GPIO pin PC1 is present. */
#define GPIO_PC_PIN2 1U /**< GPIO pin PC2 is present. */
#define GPIO_PC_PIN3 1U /**< GPIO pin PC3 is present. */
#define GPIO_PC_PIN4 1U /**< GPIO pin PC4 is present. */
#define GPIO_PC_PIN5 1U /**< GPIO pin PC5 is present. */
#define GPIO_PC_PIN6 1U /**< GPIO pin PC6 is present. */
#define GPIO_PC_PIN7 1U /**< GPIO pin PC7 is present. */
#define GPIO_PC_PIN8 1U /**< GPIO pin PC8 is present. */
#define GPIO_PC_PIN9 1U /**< GPIO pin PC9 is present. */
#define GPIO_PC_PIN10 1U /**< GPIO pin PC10 is present. */
#define GPIO_PC_PIN11 1U /**< GPIO pin PC11 is present. */
#define GPIO_PD_INDEX 3U /**< Index of port PD */
#define GPIO_PD_COUNT 16U /**< Number of pins on port PD */
#define GPIO_PD_MASK  (0xFFFFUL) /**< Port PD pin mask */
#define GPIO_PD_PIN0 1U /**< GPIO pin PD0 is present. */
#define GPIO_PD_PIN1 1U /**< GPIO pin PD1 is present. */
#define GPIO_PD_PIN2 1U /**< GPIO pin PD2 is present. */
#define GPIO_PD_PIN3 1U /**< GPIO pin PD3 is present. */
#define GPIO_PD_PIN4 1U /**< GPIO pin PD4 is present. */
#define GPIO_PD_PIN5 1U /**< GPIO pin PD5 is present. */
#define GPIO_PD_PIN6 1U /**< GPIO pin PD6 is present. */
#define GPIO_PD_PIN7 1U /**< GPIO pin PD7 is present. */
#define GPIO_PD_PIN8 1U /**< GPIO pin PD8 is present. */
#define GPIO_PD_PIN9 1U /**< GPIO pin PD9 is present. */
#define GPIO_PD_PIN10 1U /**< GPIO pin PD10 is present. */
#define GPIO_PD_PIN11 1U /**< GPIO pin PD11 is present. */
#define GPIO_PD_PIN12 1U /**< GPIO pin PD12 is present. */
#define GPIO_PD_PIN13 1U /**< GPIO pin PD13 is present. */
#define GPIO_PD_PIN14 1U /**< GPIO pin PD14 is present. */
#define GPIO_PD_PIN15 1U /**< GPIO pin PD15 is present. */

/* Fixed Resource Locations */
#define GPIO_SWCLK_PORT GPIO_PA_INDEX /**< Port of SWCLK.*/
#define GPIO_SWCLK_PIN  1U /**< Pin of SWCLK.*/
#define GPIO_SWDIO_PORT GPIO_PA_INDEX /**< Port of SWDIO.*/
#define GPIO_SWDIO_PIN  2U /**< Pin of SWDIO.*/
#define GPIO_SWV_PORT GPIO_PA_INDEX /**< Port of SWV.*/
#define GPIO_SWV_PIN  3U /**< Pin of SWV.*/
#define GPIO_TDI_PORT GPIO_PA_INDEX /**< Port of TDI.*/
#define GPIO_TDI_PIN  4U /**< Pin of TDI.*/
#define GPIO_TDO_PORT GPIO_PA_INDEX /**< Port of TDO.*/
#define GPIO_TDO_PIN  3U /**< Pin of TDO.*/
#define GPIO_TRACECLK_PORT GPIO_PA_INDEX /**< Port of TRACECLK.*/
#define GPIO_TRACECLK_PIN  4U /**< Pin of TRACECLK.*/
#define GPIO_TRACEDATA0_PORT GPIO_PA_INDEX /**< Port of TRACEDATA0.*/
#define GPIO_TRACEDATA0_PIN  3U /**< Pin of TRACEDATA0.*/
#define GPIO_TRACEDATA1_PORT GPIO_PA_INDEX /**< Port of TRACEDATA1.*/
#define GPIO_TRACEDATA1_PIN  5U /**< Pin of TRACEDATA1.*/
#define GPIO_TRACEDATA2_PORT GPIO_PA_INDEX /**< Port of TRACEDATA2.*/
#define GPIO_TRACEDATA2_PIN  6U /**< Pin of TRACEDATA2.*/
#define GPIO_TRACEDATA3_PORT GPIO_PA_INDEX /**< Port of TRACEDATA3.*/
#define GPIO_TRACEDATA3_PIN  7U /**< Pin of TRACEDATA3.*/
#define GPIO_EFP_INT_PORT GPIO_PC_INDEX /**< Port of EFP_INT.*/
#define GPIO_EFP_INT_PIN  5U /**< Pin of EFP_INT.*/
#define GPIO_EFP_TX_SCL_PORT GPIO_PC_INDEX /**< Port of EFP_TX_SCL.*/
#define GPIO_EFP_TX_SCL_PIN  2U /**< Pin of EFP_TX_SCL.*/
#define GPIO_EFP_TX_SDA_PORT GPIO_PC_INDEX /**< Port of EFP_TX_SDA.*/
#define GPIO_EFP_TX_SDA_PIN  1U /**< Pin of EFP_TX_SDA.*/
#define GPIO_EM4WU0_PORT GPIO_PA_INDEX /**< Port of EM4WU0.*/
#define GPIO_EM4WU0_PIN  5U /**< Pin of EM4WU0.*/
#define GPIO_EM4WU10_PORT GPIO_PD_INDEX /**< Port of EM4WU10.*/
#define GPIO_EM4WU10_PIN  5U /**< Pin of EM4WU10.*/
#define GPIO_EM4WU3_PORT GPIO_PB_INDEX /**< Port of EM4WU3.*/
#define GPIO_EM4WU3_PIN  1U /**< Pin of EM4WU3.*/
#define GPIO_EM4WU4_PORT GPIO_PB_INDEX /**< Port of EM4WU4.*/
#define GPIO_EM4WU4_PIN  3U /**< Pin of EM4WU4.*/
#define GPIO_EM4WU6_PORT GPIO_PC_INDEX /**< Port of EM4WU6.*/
#define GPIO_EM4WU6_PIN  0U /**< Pin of EM4WU6.*/
#define GPIO_EM4WU7_PORT GPIO_PC_INDEX /**< Port of EM4WU7.*/
#define GPIO_EM4WU7_PIN  5U /**< Pin of EM4WU7.*/
#define GPIO_EM4WU8_PORT GPIO_PC_INDEX /**< Port of EM4WU8.*/
#define GPIO_EM4WU8_PIN  7U /**< Pin of EM4WU8.*/
#define GPIO_EM4WU9_PORT GPIO_PD_INDEX /**< Port of EM4WU9.*/
#define GPIO_EM4WU9_PIN  2U /**< Pin of EM4WU9.*/
#define GPIO_THMSW_EN_PORT GPIO_PC_INDEX /**< Port of THMSW_EN.*/
#define GPIO_THMSW_EN_PIN 11U /**< Pin of THMSW_EN.*/
#define GPIO_THMSW_HALFSWITCH_PORT GPIO_PC_INDEX /**< Port of THMSW_HALFSWITCH.*/
#define GPIO_THMSW_HALFSWITCH_PIN 11U /**< Pin of THMSW_HALFSWITCH.*/
#define LCD_COM0_PORT GPIO_PD_INDEX /**< Port of COM0.*/
#define LCD_COM0_PIN  2U /**< Pin of COM0.*/
#define LCD_COM1_PORT GPIO_PD_INDEX /**< Port of COM1.*/
#define LCD_COM1_PIN  3U /**< Pin of COM1.*/
#define LCD_COM2_PORT GPIO_PD_INDEX /**< Port of COM2.*/
#define LCD_COM2_PIN  4U /**< Pin of COM2.*/
#define LCD_COM3_PORT GPIO_PD_INDEX /**< Port of COM3.*/
#define LCD_COM3_PIN  5U /**< Pin of COM3.*/
#define LCD_COM4_PORT GPIO_PA_INDEX /**< Port of COM4.*/
#define LCD_COM4_PIN 13U /**< Pin of COM4.*/
#define LCD_COM5_PORT GPIO_PA_INDEX /**< Port of COM5.*/
#define LCD_COM5_PIN 14U /**< Pin of COM5.*/
#define LCD_COM6_PORT GPIO_PB_INDEX /**< Port of COM6.*/
#define LCD_COM6_PIN  4U /**< Pin of COM6.*/
#define LCD_COM7_PORT GPIO_PB_INDEX /**< Port of COM7.*/
#define LCD_COM7_PIN  5U /**< Pin of COM7.*/
#define LCD_LCD_CP_PORT GPIO_PA_INDEX /**< Port of LCD_CP.*/
#define LCD_LCD_CP_PIN  6U /**< Pin of LCD_CP.*/
#define LCD_SEG0_PORT GPIO_PC_INDEX /**< Port of SEG0.*/
#define LCD_SEG0_PIN  0U /**< Pin of SEG0.*/
#define LCD_SEG1_PORT GPIO_PC_INDEX /**< Port of SEG1.*/
#define LCD_SEG1_PIN  1U /**< Pin of SEG1.*/
#define LCD_SEG10_PORT GPIO_PA_INDEX /**< Port of SEG10.*/
#define LCD_SEG10_PIN  4U /**< Pin of SEG10.*/
#define LCD_SEG11_PORT GPIO_PA_INDEX /**< Port of SEG11.*/
#define LCD_SEG11_PIN  5U /**< Pin of SEG11.*/
#define LCD_SEG12_PORT GPIO_PA_INDEX /**< Port of SEG12.*/
#define LCD_SEG12_PIN  7U /**< Pin of SEG12.*/
#define LCD_SEG13_PORT GPIO_PA_INDEX /**< Port of SEG13.*/
#define LCD_SEG13_PIN  8U /**< Pin of SEG13.*/
#define LCD_SEG14_PORT GPIO_PB_INDEX /**< Port of SEG14.*/
#define LCD_SEG14_PIN  0U /**< Pin of SEG14.*/
#define LCD_SEG15_PORT GPIO_PB_INDEX /**< Port of SEG15.*/
#define LCD_SEG15_PIN  1U /**< Pin of SEG15.*/
#define LCD_SEG16_PORT GPIO_PB_INDEX /**< Port of SEG16.*/
#define LCD_SEG16_PIN  2U /**< Pin of SEG16.*/
#define LCD_SEG17_PORT GPIO_PB_INDEX /**< Port of SEG17.*/
#define LCD_SEG17_PIN  3U /**< Pin of SEG17.*/
#define LCD_SEG18_PORT GPIO_PC_INDEX /**< Port of SEG18.*/
#define LCD_SEG18_PIN  8U /**< Pin of SEG18.*/
#define LCD_SEG19_PORT GPIO_PC_INDEX /**< Port of SEG19.*/
#define LCD_SEG19_PIN  9U /**< Pin of SEG19.*/
#define LCD_SEG2_PORT GPIO_PC_INDEX /**< Port of SEG2.*/
#define LCD_SEG2_PIN  2U /**< Pin of SEG2.*/
#define LCD_SEG20_PORT GPIO_PA_INDEX /**< Port of SEG20.*/
#define LCD_SEG20_PIN  9U /**< Pin of SEG20.*/
#define LCD_SEG21_PORT GPIO_PA_INDEX /**< Port of SEG21.*/
#define LCD_SEG21_PIN 10U /**< Pin of SEG21.*/
#define LCD_SEG22_PORT GPIO_PA_INDEX /**< Port of SEG22.*/
#define LCD_SEG22_PIN 11U /**< Pin of SEG22.*/
#define LCD_SEG23_PORT GPIO_PA_INDEX /**< Port of SEG23.*/
#define LCD_SEG23_PIN 12U /**< Pin of SEG23.*/
#define LCD_SEG24_PORT GPIO_PA_INDEX /**< Port of SEG24.*/
#define LCD_SEG24_PIN 13U /**< Pin of SEG24.*/
#define LCD_SEG25_PORT GPIO_PA_INDEX /**< Port of SEG25.*/
#define LCD_SEG25_PIN 14U /**< Pin of SEG25.*/
#define LCD_SEG26_PORT GPIO_PB_INDEX /**< Port of SEG26.*/
#define LCD_SEG26_PIN  4U /**< Pin of SEG26.*/
#define LCD_SEG27_PORT GPIO_PB_INDEX /**< Port of SEG27.*/
#define LCD_SEG27_PIN  5U /**< Pin of SEG27.*/
#define LCD_SEG3_PORT GPIO_PC_INDEX /**< Port of SEG3.*/
#define LCD_SEG3_PIN  3U /**< Pin of SEG3.*/
#define LCD_SEG4_PORT GPIO_PC_INDEX /**< Port of SEG4.*/
#define LCD_SEG4_PIN  4U /**< Pin of SEG4.*/
#define LCD_SEG5_PORT GPIO_PC_INDEX /**< Port of SEG5.*/
#define LCD_SEG5_PIN  5U /**< Pin of SEG5.*/
#define LCD_SEG6_PORT GPIO_PC_INDEX /**< Port of SEG6.*/
#define LCD_SEG6_PIN  6U /**< Pin of SEG6.*/
#define LCD_SEG7_PORT GPIO_PC_INDEX /**< Port of SEG7.*/
#define LCD_SEG7_PIN  7U /**< Pin of SEG7.*/
#define LCD_SEG8_PORT GPIO_PA_INDEX /**< Port of SEG8.*/
#define LCD_SEG8_PIN  0U /**< Pin of SEG8.*/
#define LCD_SEG9_PORT GPIO_PA_INDEX /**< Port of SEG9.*/
#define LCD_SEG9_PIN  1U /**< Pin of SEG9.*/
#define LESENSE_EN_0_PORT GPIO_PA_INDEX /**< Port of EN_0.*/
#define LESENSE_EN_0_PIN  3U /**< Pin of EN_0.*/
#define LESENSE_EN_1_PORT GPIO_PA_INDEX /**< Port of EN_1.*/
#define LESENSE_EN_1_PIN  4U /**< Pin of EN_1.*/
#define LESENSE_EN_2_PORT GPIO_PA_INDEX /**< Port of EN_2.*/
#define LESENSE_EN_2_PIN  5U /**< Pin of EN_2.*/
#define LFXO_LFXTAL_I_PORT GPIO_PD_INDEX /**< Port of LFXTAL_I.*/
#define LFXO_LFXTAL_I_PIN  1U /**< Pin of LFXTAL_I.*/
#define LFXO_LFXTAL_O_PORT GPIO_PD_INDEX /**< Port of LFXTAL_O.*/
#define LFXO_LFXTAL_O_PIN  0U /**< Pin of LFXTAL_O.*/
#define LFXO_LF_EXTCLK_PORT GPIO_PD_INDEX /**< Port of LF_EXTCLK.*/
#define LFXO_LF_EXTCLK_PIN  1U /**< Pin of LF_EXTCLK.*/
#define VDAC0_CH0_MAIN_OUT_PORT GPIO_PB_INDEX /**< Port of CH0_MAIN_OUT.*/
#define VDAC0_CH0_MAIN_OUT_PIN  0U /**< Pin of CH0_MAIN_OUT.*/
#define VDAC0_CH1_MAIN_OUT_PORT GPIO_PB_INDEX /**< Port of CH1_MAIN_OUT.*/
#define VDAC0_CH1_MAIN_OUT_PIN  1U /**< Pin of CH1_MAIN_OUT.*/

/* Part number capabilities */
#define ACMP_PRESENT           /** ACMP is available in this part */
#define ACMP_COUNT          2 /** 2 ACMPs available  */
#define AMUXCP_PRESENT         /** AMUXCP is available in this part */
#define AMUXCP_COUNT        1 /** 1 AMUXCPs available  */
#define BURAM_PRESENT          /** BURAM is available in this part */
#define BURAM_COUNT         1 /** 1 BURAMs available  */
#define BURTC_PRESENT          /** BURTC is available in this part */
#define BURTC_COUNT         1 /** 1 BURTCs available  */
#define CMU_PRESENT            /** CMU is available in this part */
#define CMU_COUNT           1 /** 1 CMUs available  */
#define DCDC_PRESENT           /** DCDC is available in this part */
#define DCDC_COUNT          1 /** 1 DCDCs available  */
#define DMEM_PRESENT           /** DMEM is available in this part */
#define DMEM_COUNT          1 /** 1 DMEMs available  */
#define DPLL_PRESENT           /** DPLL is available in this part */
#define DPLL_COUNT          1 /** 1 DPLLs available  */
#define EMU_PRESENT            /** EMU is available in this part */
#define EMU_COUNT           1 /** 1 EMUs available  */
#define EUSART_PRESENT         /** EUSART is available in this part */
#define EUSART_COUNT        3 /** 3 EUSARTs available  */
#define FSRCO_PRESENT          /** FSRCO is available in this part */
#define FSRCO_COUNT         1 /** 1 FSRCOs available  */
#define GPCRC_PRESENT          /** GPCRC is available in this part */
#define GPCRC_COUNT         1 /** 1 GPCRCs available  */
#define GPIO_PRESENT           /** GPIO is available in this part */
#define GPIO_COUNT          1 /** 1 GPIOs available  */
#define HFRCO_PRESENT          /** HFRCO is available in this part */
#define HFRCO_COUNT         1 /** 1 HFRCOs available  */
#define HFRCOEM23_PRESENT      /** HFRCOEM23 is available in this part */
#define HFRCOEM23_COUNT     1 /** 1 HFRCOEM23s available  */
#define HFXO_PRESENT           /** HFXO is available in this part */
#define HFXO_COUNT          1 /** 1 HFXOs available  */
#define HOSTMAILBOX_PRESENT    /** HOSTMAILBOX is available in this part */
#define HOSTMAILBOX_COUNT   1 /** 1 HOSTMAILBOXs available  */
#define I2C_PRESENT            /** I2C is available in this part */
#define I2C_COUNT           2 /** 2 I2Cs available  */
#define IADC_PRESENT           /** IADC is available in this part */
#define IADC_COUNT          1 /** 1 IADCs available  */
#define ICACHE_PRESENT         /** ICACHE is available in this part */
#define ICACHE_COUNT        1 /** 1 ICACHEs available  */
#define KEYSCAN_PRESENT        /** KEYSCAN is available in this part */
#define KEYSCAN_COUNT       1 /** 1 KEYSCANs available  */
#define LCD_PRESENT            /** LCD is available in this part */
#define LCD_COUNT           1 /** 1 LCDs available  */
#define LCDRF_PRESENT          /** LCDRF is available in this part */
#define LCDRF_COUNT         1 /** 1 LCDRFs available  */
#define LDMA_PRESENT           /** LDMA is available in this part */
#define LDMA_COUNT          1 /** 1 LDMAs available  */
#define LDMAXBAR_PRESENT       /** LDMAXBAR is available in this part */
#define LDMAXBAR_COUNT      1 /** 1 LDMAXBARs available  */
#define LESENSE_PRESENT        /** LESENSE is available in this part */
#define LESENSE_COUNT       1 /** 1 LESENSEs available  */
#define LETIMER_PRESENT        /** LETIMER is available in this part */
#define LETIMER_COUNT       1 /** 1 LETIMERs available  */
#define LFRCO_PRESENT          /** LFRCO is available in this part */
#define LFRCO_COUNT         1 /** 1 LFRCOs available  */
#define LFXO_PRESENT           /** LFXO is available in this part */
#define LFXO_COUNT          1 /** 1 LFXOs available  */
#define MSC_PRESENT            /** MSC is available in this part */
#define MSC_COUNT           1 /** 1 MSCs available  */
#define PCNT_PRESENT           /** PCNT is available in this part */
#define PCNT_COUNT          1 /** 1 PCNTs available  */
#define PRS_PRESENT            /** PRS is available in this part */
#define PRS_COUNT           1 /** 1 PRSs available  */
#define SCRATCHPAD_PRESENT     /** SCRATCHPAD is available in this part */
#define SCRATCHPAD_COUNT    1 /** 1 SCRATCHPADs available  */
#define SEMAILBOX_PRESENT      /** SEMAILBOX is available in this part */
#define SEMAILBOX_COUNT     1 /** 1 SEMAILBOXs available  */
#define SMU_PRESENT            /** SMU is available in this part */
#define SMU_COUNT           1 /** 1 SMUs available  */
#define SYSCFG_PRESENT         /** SYSCFG is available in this part */
#define SYSCFG_COUNT        1 /** 1 SYSCFGs available  */
#define SYSRTC_PRESENT         /** SYSRTC is available in this part */
#define SYSRTC_COUNT        1 /** 1 SYSRTCs available  */
#define TIMER_PRESENT          /** TIMER is available in this part */
#define TIMER_COUNT         5 /** 5 TIMERs available  */
#define ULFRCO_PRESENT         /** ULFRCO is available in this part */
#define ULFRCO_COUNT        1 /** 1 ULFRCOs available  */
#define USART_PRESENT          /** USART is available in this part */
#define USART_COUNT         1 /** 1 USARTs available  */
#define VDAC_PRESENT           /** VDAC is available in this part */
#define VDAC_COUNT          1 /** 1 VDACs available  */
#define WDOG_PRESENT           /** WDOG is available in this part */
#define WDOG_COUNT          2 /** 2 WDOGs available  */
#define DEVINFO_PRESENT        /** DEVINFO is available in this part */
#define DEVINFO_COUNT       1 /** 1 DEVINFOs available  */

/* Include standard ARM headers for the core */
#include "core_cm33.h"   /* Core Header File */
#include "system_efm32pg28.h" /* System Header File */


/** @} End of group EFM32PG28B200F512IM68_Part */

/**************************************************************************//**
 * @defgroup EFM32PG28B200F512IM68_Peripheral_TypeDefs EFM32PG28B200F512IM68 Peripheral TypeDefs
 * @{
 * @brief Device Specific Peripheral Register Structures
 *****************************************************************************/
#include "efm32pg28_scratchpad.h"
#include "efm32pg28_emu.h"
#include "efm32pg28_cmu.h"
#include "efm32pg28_hfrco.h"
#include "efm32pg28_fsrco.h"
#include "efm32pg28_dpll.h"
#include "efm32pg28_lfxo.h"
#include "efm32pg28_lfrco.h"
#include "efm32pg28_ulfrco.h"
#include "efm32pg28_msc.h"
#include "efm32pg28_icache.h"
#include "efm32pg28_prs.h"
#include "efm32pg28_gpio.h"
#include "efm32pg28_ldma.h"
#include "efm32pg28_ldmaxbar.h"
#include "efm32pg28_timer.h"
#include "efm32pg28_usart.h"
#include "efm32pg28_burtc.h"
#include "efm32pg28_i2c.h"
#include "efm32pg28_syscfg.h"
#include "efm32pg28_buram.h"
#include "efm32pg28_gpcrc.h"
#include "efm32pg28_dcdc.h"
#include "efm32pg28_mailbox.h"
#include "efm32pg28_eusart.h"
#include "efm32pg28_sysrtc.h"
#include "efm32pg28_lcd.h"
#include "efm32pg28_keyscan.h"
#include "efm32pg28_mpahbram.h"
#include "efm32pg28_lcdrf.h"
#include "efm32pg28_smu.h"
#include "efm32pg28_letimer.h"
#include "efm32pg28_iadc.h"
#include "efm32pg28_acmp.h"
#include "efm32pg28_amuxcp.h"
#include "efm32pg28_vdac.h"
#include "efm32pg28_pcnt.h"
#include "efm32pg28_lesense.h"
#include "efm32pg28_hfxo.h"
#include "efm32pg28_wdog.h"
#include "efm32pg28_semailbox.h"
#include "efm32pg28_devinfo.h"

/* Custom headers for LDMAXBAR and PRS mappings */
#include "efm32pg28_prs_signals.h"
#include "efm32pg28_dma_descriptor.h"
#include "efm32pg28_ldmaxbar_defines.h"
/** @} End of group EFM32PG28B200F512IM68_Peripheral_TypeDefs  */

/**************************************************************************//**
* @defgroup EFM32PG28B200F512IM68_Peripheral_Base EFM32PG28B200F512IM68 Peripheral Memory Map
* @{
*****************************************************************************/

#define SCRATCHPAD_S_BASE      (0x40000000UL) /* SCRATCHPAD_S base address */
#define EMU_S_BASE             (0x40004000UL) /* EMU_S base address */
#define CMU_S_BASE             (0x40008000UL) /* CMU_S base address */
#define HFRCO0_S_BASE          (0x40010000UL) /* HFRCO0_S base address */
#define FSRCO_S_BASE           (0x40018000UL) /* FSRCO_S base address */
#define DPLL0_S_BASE           (0x4001C000UL) /* DPLL0_S base address */
#define LFXO_S_BASE            (0x40020000UL) /* LFXO_S base address */
#define LFRCO_S_BASE           (0x40024000UL) /* LFRCO_S base address */
#define ULFRCO_S_BASE          (0x40028000UL) /* ULFRCO_S base address */
#define MSC_S_BASE             (0x40030000UL) /* MSC_S base address */
#define ICACHE0_S_BASE         (0x40034000UL) /* ICACHE0_S base address */
#define PRS_S_BASE             (0x40038000UL) /* PRS_S base address */
#define GPIO_S_BASE            (0x4003C000UL) /* GPIO_S base address */
#define LDMA_S_BASE            (0x40040000UL) /* LDMA_S base address */
#define LDMAXBAR_S_BASE        (0x40044000UL) /* LDMAXBAR_S base address */
#define TIMER0_S_BASE          (0x40048000UL) /* TIMER0_S base address */
#define TIMER1_S_BASE          (0x4004C000UL) /* TIMER1_S base address */
#define TIMER2_S_BASE          (0x40050000UL) /* TIMER2_S base address */
#define TIMER3_S_BASE          (0x40054000UL) /* TIMER3_S base address */
#define TIMER4_S_BASE          (0x40058000UL) /* TIMER4_S base address */
#define USART0_S_BASE          (0x4005C000UL) /* USART0_S base address */
#define BURTC_S_BASE           (0x40064000UL) /* BURTC_S base address */
#define I2C1_S_BASE            (0x40068000UL) /* I2C1_S base address */
#define SYSCFG_S_CFGNS_BASE    (0x40078000UL) /* SYSCFG_S_CFGNS base address */
#define SYSCFG_S_BASE          (0x4007C000UL) /* SYSCFG_S base address */
#define BURAM_S_BASE           (0x40080000UL) /* BURAM_S base address */
#define GPCRC_S_BASE           (0x40088000UL) /* GPCRC_S base address */
#define DCDC_S_BASE            (0x40094000UL) /* DCDC_S base address */
#define HOSTMAILBOX_S_BASE     (0x40098000UL) /* HOSTMAILBOX_S base address */
#define EUSART1_S_BASE         (0x400A0000UL) /* EUSART1_S base address */
#define EUSART2_S_BASE         (0x400A4000UL) /* EUSART2_S base address */
#define SYSRTC0_S_BASE         (0x400A8000UL) /* SYSRTC0_S base address */
#define LCD_S_BASE             (0x400AC000UL) /* LCD_S base address */
#define KEYSCAN_S_BASE         (0x400B0000UL) /* KEYSCAN_S base address */
#define DMEM_S_BASE            (0x400B4000UL) /* DMEM_S base address */
#define LCDRF_S_BASE           (0x400C0000UL) /* LCDRF_S base address */
#define SMU_S_BASE             (0x44008000UL) /* SMU_S base address */
#define SMU_S_CFGNS_BASE       (0x4400C000UL) /* SMU_S_CFGNS base address */
#define LETIMER0_S_BASE        (0x49000000UL) /* LETIMER0_S base address */
#define IADC0_S_BASE           (0x49004000UL) /* IADC0_S base address */
#define ACMP0_S_BASE           (0x49008000UL) /* ACMP0_S base address */
#define ACMP1_S_BASE           (0x4900C000UL) /* ACMP1_S base address */
#define AMUXCP0_S_BASE         (0x49020000UL) /* AMUXCP0_S base address */
#define VDAC0_S_BASE           (0x49024000UL) /* VDAC0_S base address */
#define PCNT0_S_BASE           (0x49030000UL) /* PCNT0_S base address */
#define LESENSE_S_BASE         (0x49038000UL) /* LESENSE_S base address */
#define HFRCOEM23_S_BASE       (0x4A000000UL) /* HFRCOEM23_S base address */
#define HFXO0_S_BASE           (0x4A004000UL) /* HFXO0_S base address */
#define I2C0_S_BASE            (0x4B000000UL) /* I2C0_S base address */
#define WDOG0_S_BASE           (0x4B004000UL) /* WDOG0_S base address */
#define WDOG1_S_BASE           (0x4B008000UL) /* WDOG1_S base address */
#define EUSART0_S_BASE         (0x4B010000UL) /* EUSART0_S base address */
#define SEMAILBOX_S_HOST_BASE  (0x4C000000UL) /* SEMAILBOX_S_HOST base address */

