SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFM32PG28/Include/efm32pg28b200f512im68.h
/* Common peripheral register block offsets. */
#define PER_REG_BLOCK_SET_OFFSET  0x1000UL  /**< Offset to SET register block */
#define PER_REG_BLOCK_CLR_OFFSET  0x2000UL  /**< Offset to CLEAR register block */
#define PER_REG_BLOCK_TGL_OFFSET  0x3000UL  /**< Offset to TOGGLE register block */

#define DMEM_AHB_DATA_WIDTH           0x20UL /**> Data width of the AHB interface */
#define DMEM_BANK0_SIZE               0x4000UL /**> Bank0 size */
#define DMEM_BANK10_SIZE              0x4000UL /**> Bank10 size */
#define DMEM_BANK11_SIZE              0x4000UL /**> Bank11 size */
#define DMEM_BANK12_SIZE              0x4000UL /**> Bank12 size */
#define DMEM_BANK13_SIZE              0x4000UL /**> Bank13 size */
#define DMEM_BANK14_SIZE              0x4000UL /**> Bank14 size */
#define DMEM_BANK15_SIZE              0x4000UL /**> Bank15 size */
#define DMEM_BANK16_SIZE              0x0UL  /**> Bank16 size */
#define DMEM_BANK17_SIZE              0x0UL  /**> Bank17 size */
#define DMEM_BANK18_SIZE              0x0UL  /**> Bank18 size */
#define DMEM_BANK19_SIZE              0x0UL  /**> Bank19 size */
#define DMEM_BANK1_SIZE               0x4000UL /**> Bank1 size */
#define DMEM_BANK20_SIZE              0x0UL  /**> Bank20 size */
#define DMEM_BANK21_SIZE              0x0UL  /**> Bank21 size */
#define DMEM_BANK22_SIZE              0x0UL  /**> Bank22 size */
#define DMEM_BANK23_SIZE              0x0UL  /**> Bank23 size */
#define DMEM_BANK24_SIZE              0x0UL  /**> Bank24 size */
#define DMEM_BANK25_SIZE              0x0UL  /**> Bank25 size */
#define DMEM_BANK26_SIZE              0x0UL  /**> Bank26 size */
#define DMEM_BANK27_SIZE              0x0UL  /**> Bank27 size */
#define DMEM_BANK28_SIZE              0x0UL  /**> Bank28 size */
#define DMEM_BANK29_SIZE              0x0UL  /**> Bank29 size */
#define DMEM_BANK2_SIZE               0x4000UL /**> Bank2 size */
#define DMEM_BANK30_SIZE              0x0UL  /**> Bank30 size */
#define DMEM_BANK31_SIZE              0x0UL  /**> Bank31 size */
#define DMEM_BANK3_SIZE               0x4000UL /**> Bank3 size */
#define DMEM_BANK4_SIZE               0x4000UL /**> Bank4 size */
#define DMEM_BANK5_SIZE               0x4000UL /**> Bank5 size */
#define DMEM_BANK6_SIZE               0x4000UL /**> Bank6 size */
#define DMEM_BANK7_SIZE               0x4000UL /**> Bank7 size */
#define DMEM_BANK8_SIZE               0x4000UL /**> Bank8 size */
#define DMEM_BANK9_SIZE               0x4000UL /**> Bank9 size */
#define DMEM_ECC_EXCLUDE              0x0UL  /**> ECC exclude */
#define DMEM_MEM_SIZE                 0x40000UL /**> Total memory size */
#define DMEM_NUM_BANKS                0x10UL /**> Number of physical SRAM banks */
#define DMEM_NUM_PORTS                0x4UL  /**> Number of AHB slave ports */
#define DMEM_NUM_PORTS_IS_2           0x0UL  /**> Boolean indicating if NUM_PORTS=2 */
#define DMEM_WAITSTATE_EXCLUDE        0x1UL  /**> Waitstate exclude */

#define HFRCO0_EM23ONDEMAND           0x0UL  /**> EM23 On Demand */
#define HFRCO0_EXCLUDEEM23ONDEMAND    0x1UL  /**> Exclude EM23 On Demand */

#define LFXO_NO_CTUNE                 0x0UL  /**> CTUNE Not Present */
#define LFXO_CTUNE                    0x1UL  /**> CTUNE Present */

#define MSC_CDA_PRESENT               0x0UL  /**>  */
#define MSC_FDIO_WIDTH                0x40UL /**> None */
#define MSC_FLASHADDRBITS             0x15UL /**> None */
#define MSC_FLASHBLOCKADDRBITS        0x15UL /**> None */
#define MSC_FLASH_BLOCK_INFO_PCOUNT   0x2UL  /**> None */
#define MSC_FLASH_BLOCK_MAIN_PCOUNT   0x90UL /**>  */
#define MSC_INFOADDRBITS              0xEUL  /**> None */
#define MSC_INFOBLOCKADDRBITS         0xEUL  /**> None */
#define MSC_INFO_PSIZE_BITS           0xDUL  /**> None */
#define MSC_MAIN_PSIZE_BITS           0xDUL  /**> None */
#define MSC_REDUNDANCY                0x2UL  /**> None */
#define MSC_ROOTMAIN_PRESENT          0x1UL  /**>  */
#define MSC_UD_PRESENT                0x1UL  /**>  */
#define MSC_YADDRBITS                 0x6UL  /**>  */

#define ICACHE0_AHB_LITE              0x0UL  /**> AHB Lite */
#define ICACHE0_CACHEABLE_SIZE        0x100000UL /**> Cache Size */
#define ICACHE0_CACHEABLE_START       0x8000000UL /**> Cache Start */
#define ICACHE0_DEFAULT_OFF           0x0UL  /**> Default off */
#define ICACHE0_FLASH_SIZE            0x100000UL /**> Flash size */
#define ICACHE0_FLASH_START           0x8000000UL /**> Flash start */
#define ICACHE0_LOOPCACHE_MEM_ADDR_BITS 0x3UL  /**> Loopcache Memory Address bits */
#define ICACHE0_LOOPCACHE_STICKINESS_BITS 0x4UL  /**> Loopcache Stickiness bits */
#define ICACHE0_PARITY_BITS           0x1UL  /**> Use Parity */
#define ICACHE0_PC_BITS               0x20UL /**> Performance Counter bits */
#define ICACHE0_PIPE_STAGE            0x1UL  /**> Pipeline Stage */
#define ICACHE0_RAM_ADDR_BITS         0x0UL  /**> RAM Address bits */
#define ICACHE0_RAM_DATA_BITS         0x0UL  /**> RAM Data bits */
#define ICACHE0_SET_BITS              0x7UL  /**> Set bits */
#define ICACHE0_USE_HREADY_GATING     0x1UL  /**> Use HREADY gating */
#define ICACHE0_USE_IDLE_GATING       0x1UL  /**> Use IDLE gating */
#define ICACHE0_USE_LOOPCACHE         0x1UL  /**> Use Loopcache */
#define ICACHE0_WAY_BITS              0x1UL  /**> Way bits */
#define ICACHE0_WORDS_PER_BLOCK       0x0UL  /**> Words Per Block */
#define ICACHE0_WPB_BITS              0x1UL  /**> Words Per Block bits */
#define ICACHE0_WPL_BITS              0x3UL  /**> Words Per Line bits */

#define PRS_ASYNC_CH_NUM              0xCUL  /**> None */
#define PRS_PRSSEL_WIDTH              0x4UL  /**> New Param */
#define PRS_SPRSSEL_WIDTH             0x2UL  /**> New Param */
#define PRS_SYNC_CH_NUM               0x4UL  /**> None */

#define GPIO_COMALLOC_WIDTH           0x4UL  /**> New Param */
#define GPIO_MODE_WIDTH               0x4UL  /**> Mode Width */
#define GPIO_NUM_EM4_WU               0xCUL  /**> New Param */
#define GPIO_NUM_EVEN_PA              0x8UL  /**> Num of even pins port A */
#define GPIO_NUM_EVEN_PB              0x4UL  /**> Num of even pins port B */
#define GPIO_NUM_EVEN_PC              0x6UL  /**> Num of even pins port C */
#define GPIO_NUM_EVEN_PD              0x8UL  /**> Num of even pins port D */
#define GPIO_NUM_EXT_INT              0x10UL /**> New Param */
#define GPIO_NUM_EXT_INT_L            0x8UL  /**> New Param */
#define GPIO_NUM_EXT_INT_U            0x8UL  /**> New Param */
#define GPIO_NUM_EXT_INT_U_ZERO       0x0UL  /**> New Param */
#define GPIO_NUM_ODD_PA               0x7UL  /**> Num of odd pins port A */
#define GPIO_NUM_ODD_PB               0x4UL  /**> Num of odd pins port B */
#define GPIO_NUM_ODD_PC               0x6UL  /**> Num of odd pins port C */
#define GPIO_NUM_ODD_PD               0x8UL  /**> Num of odd pins port D */
#define GPIO_PINSEL_WIDTH             0x4UL  /**> Route config pin select width */
#define GPIO_PORTSEL_WIDTH            0x2UL  /**> Route config port select width */
#define GPIO_PORT_A_WIDTH             0xFUL  /**> Port A Width */
#define GPIO_PORT_A_WIDTH_ZERO        0x0UL  /**> Port A Width is Zero */
#define GPIO_PORT_A_WL                0x8UL  /**> New Param */
#define GPIO_PORT_A_WU                0x7UL  /**> New Param */
#define GPIO_PORT_A_WU_ZERO           0x0UL  /**> New Param */
#define GPIO_PORT_B_WIDTH             0x8UL  /**> Port B Width */
#define GPIO_PORT_B_WIDTH_ZERO        0x0UL  /**> Port B Width is Zero */
#define GPIO_PORT_B_WL                0x8UL  /**> New Param */
#define GPIO_PORT_B_WU                0x0UL  /**> New Param */
#define GPIO_PORT_B_WU_ZERO           0x1UL  /**> New Param */
#define GPIO_PORT_C_WIDTH             0xCUL  /**> Port C Width */
#define GPIO_PORT_C_WIDTH_ZERO        0x0UL  /**> Port C Width is Zero */
#define GPIO_PORT_C_WL                0x8UL  /**> New Param */
#define GPIO_PORT_C_WU                0x4UL  /**> New Param */
#define GPIO_PORT_C_WU_ZERO           0x0UL  /**> New Param */
#define GPIO_PORT_D_WIDTH             0x10UL /**> Port D Width */
#define GPIO_PORT_D_WIDTH_ZERO        0x0UL  /**> Port D Width is Zero */
#define GPIO_PORT_D_WL                0x8UL  /**> New Param */
#define GPIO_PORT_D_WU                0x8UL  /**> New Param */
#define GPIO_PORT_D_WU_ZERO           0x0UL  /**> New Param */
#define GPIO_SEGALLOC_WIDTH           0x1CUL /**> New Param */
#define GPIO_SLEWRATE_WIDTH           0x3UL  /**> Slew Rate Width Param */

