SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFM32PG28/Include/efm32pg28b200f512im68.h
#define LDMA_CH_BITS                  0x5UL  /**> New Param */
#define LDMA_CH_NUM                   0x8UL  /**> New Param */
#define LDMA_FIFO_BITS                0x5UL  /**> New Param */
#define LDMA_FIFO_DEPTH               0x10UL /**> New Param */

#define LDMAXBAR_CH_BITS              0x5UL  /**> None */
#define LDMAXBAR_CH_NUM               0x8UL  /**> None */
#define LDMAXBAR_SIGSEL_W             0x4UL  /**> New Param */
#define LDMAXBAR_SOURCESEL_W          0x6UL  /**> New Param */

#define TIMER0_CC_NUM                 0x3UL  /**> Number of Compare/Capture Channels */
#define TIMER0_CNTWIDTH               0x20UL /**> Counter Width */
#define TIMER0_DTI                    0x1UL  /**> Dead-time insertion enabled */
#define TIMER0_DTI_CC_NUM             0x3UL  /**> Number of DTI Channels */
#define TIMER0_NO_DTI                 0x0UL  /**>  */

#define TIMER1_CC_NUM                 0x3UL  /**> Number of Compare/Capture Channels */
#define TIMER1_CNTWIDTH               0x10UL /**> Counter Width */
#define TIMER1_DTI                    0x1UL  /**> Dead-time insertion enabled */
#define TIMER1_DTI_CC_NUM             0x3UL  /**> Number of DTI Channels */
#define TIMER1_NO_DTI                 0x0UL  /**>  */

#define TIMER2_CC_NUM                 0x3UL  /**> Number of Compare/Capture Channels */
#define TIMER2_CNTWIDTH               0x10UL /**> Counter Width */
#define TIMER2_DTI                    0x1UL  /**> Dead-time insertion enabled */
#define TIMER2_DTI_CC_NUM             0x3UL  /**> Number of DTI Channels */
#define TIMER2_NO_DTI                 0x0UL  /**>  */

#define TIMER3_CC_NUM                 0x3UL  /**> Number of Compare/Capture Channels */
#define TIMER3_CNTWIDTH               0x10UL /**> Counter Width */
#define TIMER3_DTI                    0x1UL  /**> Dead-time insertion enabled */
#define TIMER3_DTI_CC_NUM             0x3UL  /**> Number of DTI Channels */
#define TIMER3_NO_DTI                 0x0UL  /**>  */

#define TIMER4_CC_NUM                 0x3UL  /**> Number of Compare/Capture Channels */
#define TIMER4_CNTWIDTH               0x10UL /**> Counter Width */
#define TIMER4_DTI                    0x1UL  /**> Dead-time insertion enabled */
#define TIMER4_DTI_CC_NUM             0x3UL  /**> Number of DTI Channels */
#define TIMER4_NO_DTI                 0x0UL  /**>  */

#define USART0_AUTOTX_REG             0x1UL  /**> None */
#define USART0_AUTOTX_REG_B           0x0UL  /**> None */
#define USART0_AUTOTX_TRIGGER         0x1UL  /**> None */
#define USART0_AUTOTX_TRIGGER_B       0x0UL  /**> New Param */
#define USART0_CLK_PRS                0x1UL  /**> None */
#define USART0_CLK_PRS_B              0x0UL  /**> New Param */
#define USART0_FLOW_CONTROL           0x1UL  /**> None */
#define USART0_FLOW_CONTROL_B         0x0UL  /**> New Param */
#define USART0_I2S                    0x1UL  /**> None */
#define USART0_I2S_B                  0x0UL  /**> New Param */
#define USART0_IRDA_AVAILABLE         0x1UL  /**> None */
#define USART0_IRDA_AVAILABLE_B       0x0UL  /**> New Param */
#define USART0_MVDIS_FUNC             0x1UL  /**> None */
#define USART0_MVDIS_FUNC_B           0x0UL  /**> New Param */
#define USART0_RX_PRS                 0x1UL  /**> None */
#define USART0_RX_PRS_B               0x0UL  /**> New Param */
#define USART0_SC_AVAILABLE           0x1UL  /**> None */
#define USART0_SC_AVAILABLE_B         0x0UL  /**> New Param */
#define USART0_SYNC_AVAILABLE         0x1UL  /**> None */
#define USART0_SYNC_AVAILABLE_B       0x0UL  /**> New Param */
#define USART0_SYNC_LATE_SAMPLE       0x1UL  /**> None */
#define USART0_SYNC_LATE_SAMPLE_B     0x0UL  /**> New Param */
#define USART0_TIMER                  0x1UL  /**> New Param */
#define USART0_TIMER_B                0x0UL  /**> New Param */

#define BURTC_CNTWIDTH                0x20UL /**> None */
#define BURTC_PRECNT_WIDTH            0xFUL  /**>  */

#define I2C1_DELAY                    0x7D0UL /**> Delay cell selection */
#define I2C1_DELAY_CHAIN_NUM          0x2UL  /**> Number of delay chain */

#define SYSCFG_CHIP_PARTNUMBER        0x2UL  /**> Chip Part Number */
#define SYSCFG_DEMODRAM_INST_COUNT    0x1UL  /**>  */
#define SYSCFG_FRCRAM_INST_COUNT      0x2UL  /**>  */
#define SYSCFG_SEQRAM_INST_COUNT      0x2UL  /**> None */
#define SYSCFG_SWINT_NUM              0x4UL  /**> Software interupts */

#define DCDC_DRVSPEED_WIDTH           0x2UL  /**> Drive Speed bitfield width */
#define DCDC_IPKVAL_WIDTH             0x4UL  /**> Peak Current Setting bitfield Width */
#define DCDC_VCMPIBIAS_WIDTH          0x2UL  /**> VCMP ibias bitfield width */

#define HOSTMAILBOX_NUM_MSGPTRS       0x4UL  /**>  */

#define EUSART1_EM2_CAPABLE           0x0UL  /**> EM2 Capable instance */
#define EUSART1_NOT_EM2_CAPABLE       0x1UL  /**> Not EM2 Capable instance */

#define EUSART2_EM2_CAPABLE           0x0UL  /**> EM2 Capable instance */
#define EUSART2_NOT_EM2_CAPABLE       0x1UL  /**> Not EM2 Capable instance */

#define SYSRTC0_GROUP0_ALTIRQDIS      0x1UL  /**> Group 0 Alternate IRQ disable */
#define SYSRTC0_GROUP0_CAPDIS         0x0UL  /**> Group 0 Capture disable */
#define SYSRTC0_GROUP0_CMP1DIS        0x0UL  /**> Group 0 Compare1 disable */
#define SYSRTC0_GROUP0_DIS            0x0UL  /**> Group 0 Disable */
#define SYSRTC0_GROUP0_ROOTDIS        0x1UL  /**> Group 0 ROOT disable */
#define SYSRTC0_GROUP1_ALTIRQDIS      0x0UL  /**> Group 1 Alternate IRQ disable */
#define SYSRTC0_GROUP1_CAPDIS         0x0UL  /**> Group 1 Capture disable */
#define SYSRTC0_GROUP1_CMP1DIS        0x0UL  /**> Group 1 Compare1 disable */
#define SYSRTC0_GROUP1_DIS            0x0UL  /**> Group 1 Disable */
#define SYSRTC0_GROUP1_ROOTDIS        0x1UL  /**> Group 1 ROOT disable */
#define SYSRTC0_GROUP2_ALTIRQDIS      0x1UL  /**> Group 2 Alternate IRQ disable */
#define SYSRTC0_GROUP2_CAPDIS         0x1UL  /**> Group 2 Capture disable */
#define SYSRTC0_GROUP2_CMP1DIS        0x1UL  /**> Group 2 Compare1 disable */
#define SYSRTC0_GROUP2_DIS            0x0UL  /**> Group 2 Disable */
#define SYSRTC0_GROUP2_ROOTDIS        0x0UL  /**> Group 2 ROOT disable */
#define SYSRTC0_GROUP3_ALTIRQDIS      0x1UL  /**> Group 3 Alternate IRQ disable */
#define SYSRTC0_GROUP3_CAPDIS         0x1UL  /**> Group 3 Capture disable */
#define SYSRTC0_GROUP3_CMP1DIS        0x1UL  /**> Group 3 Compare1 disable */
#define SYSRTC0_GROUP3_DIS            0x1UL  /**> Group 3 Disable */
#define SYSRTC0_GROUP3_ROOTDIS        0x1UL  /**> Group 3 ROOT disable */
#define SYSRTC0_GROUP4_ALTIRQDIS      0x1UL  /**> Group 4 Alternate IRQ disable */
#define SYSRTC0_GROUP4_CAPDIS         0x1UL  /**> Group 4 Capture disable */
#define SYSRTC0_GROUP4_CMP1DIS        0x1UL  /**> Group 4 Compare1 disable */
#define SYSRTC0_GROUP4_DIS            0x1UL  /**> Group 4 Disable */
#define SYSRTC0_GROUP4_ROOTDIS        0x1UL  /**> Group 4 ROOT disable */
#define SYSRTC0_GROUP5_ALTIRQDIS      0x1UL  /**> Group 5 Alternate IRQ disable */
#define SYSRTC0_GROUP5_CAPDIS         0x1UL  /**> Group 5 Capture disable */
#define SYSRTC0_GROUP5_CMP1DIS        0x1UL  /**> Group 5 Compare1 disable */
#define SYSRTC0_GROUP5_DIS            0x1UL  /**> Group 5 Disable */
#define SYSRTC0_GROUP5_ROOTDIS        0x1UL  /**> Group 5 ROOT disable */
#define SYSRTC0_GROUP6_ALTIRQDIS      0x1UL  /**> Group 6 Alternate IRQ disable */
#define SYSRTC0_GROUP6_CAPDIS         0x1UL  /**> Group 6 Capture disable */
#define SYSRTC0_GROUP6_CMP1DIS        0x1UL  /**> Group 6 Compare1 disable */
#define SYSRTC0_GROUP6_DIS            0x1UL  /**> Group 6 Disable */
#define SYSRTC0_GROUP6_ROOTDIS        0x1UL  /**> Group 6 ROOT disable */
#define SYSRTC0_GROUP7_ALTIRQDIS      0x1UL  /**> Group 7 Alternate IRQ disable */
#define SYSRTC0_GROUP7_CAPDIS         0x1UL  /**> Group 7 Capture disable */
#define SYSRTC0_GROUP7_CMP1DIS        0x1UL  /**> Group 7 Compare1 disable */
#define SYSRTC0_GROUP7_DIS            0x1UL  /**> Group 7 Disable */
#define SYSRTC0_GROUP7_ROOTDIS        0x1UL  /**> Group 7 ROOT disable */
#define SYSRTC0_ROOTDIS               0x0UL  /**> ROOT disable */

#define LCD_COM_NUM                   0x4UL  /**> None */
#define LCD_NO_ANIM_LOCS              0x1UL  /**> None */
#define LCD_NO_BANKED_SEG             0x1UL  /**>  */
#define LCD_NO_DSC                    0x0UL  /**> None */
#define LCD_NO_EXTOSC                 0x0UL  /**> None */
#define LCD_OCTAPLEX                  0x1UL  /**> None */
#define LCD_SEGASCOM_NUM              0x4UL  /**> None */
#define LCD_NO_UPPER_SEGMENTS         0x0UL  /**>  */
#define LCD_SEG_NUM                   0x1CUL /**> None */
#define LCD_SEGASCOM_SEGSTART         0x18UL /**>  */
#define LCD_SEL_WIDTH                 0x3UL  /**> None */

