SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFM32PG28/Include/efm32pg28b200f512im68.h
#define KEYSCAN_COLNUM                0x8UL  /**> COLNUM */
#define KEYSCAN_COLWIDTH              0x3UL  /**> COLWIDTH */
#define KEYSCAN_ROWNUM                0x6UL  /**> ROWNUM */

#define SMU_NUM_BMPUS                 0xAUL  /**> Number of BMPUs */
#define SMU_NUM_PPU_PERIPHS           0x3AUL /**> Number of PPU Peripherals */
#define SMU_NUM_PPU_PERIPHS_MOD_32    0x1AUL /**> Number of PPU Peripherals (mod 32) */
#define SMU_NUM_PPU_PERIPHS_SUB_32    0x1AUL /**> Number of PPU peripherals minus 32 */
#define SMU_PERIPHID_BITS             0x8UL  /**> Bits used for Peripheral ID */

#define LETIMER0_CNT_WIDTH            0x18UL /**> Count Width */

#define IADC0_CONFIGNUM               0x2UL  /**> CONFIG */
#define IADC0_FULLRANGEUNIPOLAR       0x0UL  /**> FULLRANGEUNIPOLAR */
#define IADC0_SCANBYTES               0x1UL  /**> SCANBYTES */
#define IADC0_ENTRIES                 0x10UL /**> ENTRIES */

#define ACMP0_DAC_INPUT               0x1UL  /**> None */
#define ACMP0_EXT_OVR_IF              0x1UL  /**> None */

#define ACMP1_DAC_INPUT               0x1UL  /**> None */
#define ACMP1_EXT_OVR_IF              0x1UL  /**> None */

#define AMUXCP0_AMUXCPNUM             0x3UL  /**> AMUXCPNUM */

#define VDAC0_ALT_WIDTH               0x6UL  /**> VOUT_AUX Out Width */
#define VDAC0_CH0_TRIG_LESENSE        0x1UL  /**> CH0 Trig Source = LESENSE */
#define VDAC0_CH1_TRIG_LESENSE        0x0UL  /**> CH1 Trig Source = LESENSE */
#define VDAC0_FIFO_DEPTH              0x4UL  /**> WFIFO Depth */
#define VDAC0_INT_PRESC_WIDTH         0x7UL  /**> Internal Prescaler Width */
#define VDAC0_RESOLUTION              0xCUL  /**> DAC Resolution */

#define PCNT0_PCNT_WIDTH              0x10UL /**> None */

#define LESENSE_CHANNEL_NUM           0x10UL /**> None */
#define LESENSE_RIPCNT_WIDTH          0x10UL /**> None */
#define LESENSE_STATE_NUM             0x20UL /**> None */

#define HFRCOEM23_EM23ONDEMAND        0x1UL  /**> EM23 On Demand */
#define HFRCOEM23_EXCLUDEEM23ONDEMAND 0x0UL  /**> Exclude EM23 On Demand */

#define HFXO0_BUFOUT                  0x1UL  /**> BUFOUT */
#define HFXO0_EXCLUDEBUFOUT           0x0UL  /**> Exclude BUFOUT */

#define I2C0_DELAY                    0x3E8UL /**> Delay cell selection */
#define I2C0_DELAY_CHAIN_NUM          0x2UL  /**> Number of delay chain */

#define WDOG0_PCNUM                   0x2UL  /**> None */

#define WDOG1_PCNUM                   0x2UL  /**> None */

#define EUSART0_EM2_CAPABLE           0x1UL  /**> EM2 Capable instance */
#define EUSART0_NOT_EM2_CAPABLE       0x0UL  /**> Not EM2 Capable instance */

/* Instance macros for ACMP */
#define ACMP(n)                            ( ((n)==0) ? ACMP0 :\
                                            ((n)==1) ? ACMP1 :\
                                            0x0UL)
#define ACMP_NUM(ref)                      ( ((ref)==ACMP0) ? 0 :\
                                            ((ref)==ACMP1) ? 1 :\
                                            -1)
#define ACMP_DAC_INPUT(n)                  ( ((n)==0) ? ACMP0_DAC_INPUT :\
                                            ((n)==1) ? ACMP1_DAC_INPUT :\
                                            0x0UL)
#define ACMP_EXT_OVR_IF(n)                 ( ((n)==0) ? ACMP0_EXT_OVR_IF :\
                                            ((n)==1) ? ACMP1_EXT_OVR_IF :\
                                            0x0UL)

/* Instance macros for EUSART */
#define EUSART(n)                          ( ((n)==0) ? EUSART0 :\
                                            ((n)==1) ? EUSART1 :\
                                            ((n)==2) ? EUSART2 :\
                                            0x0UL)
#define EUSART_NUM(ref)                    ( ((ref)==EUSART0) ? 0 :\
                                            ((ref)==EUSART1) ? 1 :\
                                            ((ref)==EUSART2) ? 2 :\
                                            -1)
#define EUSART_EM2_CAPABLE(n)              ( ((n)==0) ? EUSART0_EM2_CAPABLE :\
                                            ((n)==1) ? EUSART1_EM2_CAPABLE :\
                                            ((n)==2) ? EUSART2_EM2_CAPABLE :\
                                            0x0UL)
#define EUSART_NOT_EM2_CAPABLE(n)          ( ((n)==0) ? EUSART0_NOT_EM2_CAPABLE :\
                                            ((n)==1) ? EUSART1_NOT_EM2_CAPABLE :\
                                            ((n)==2) ? EUSART2_NOT_EM2_CAPABLE :\
                                            0x0UL)

/* Instance macros for HFRCO */
#define HFRCO(n)                           ( ((n)==0) ? HFRCO0 :\
                                            ((n)==1) ? HFRCOEM23 :\
                                            0x0UL)
#define HFRCO_NUM(ref)                     ( ((ref)==HFRCO0) ? 0 :\
                                            ((ref)==HFRCOEM23) ? 1 :\
                                            -1)
#define HFRCO_EM23ONDEMAND(n)              ( ((n)==0) ? HFRCO0_EM23ONDEMAND :\
                                            ((n)==1) ? HFRCOEM23_EM23ONDEMAND :\
                                            0x0UL)
#define HFRCO_EXCLUDEEM23ONDEMAND(n)       ( ((n)==0) ? HFRCO0_EXCLUDEEM23ONDEMAND :\
                                            ((n)==1) ? HFRCOEM23_EXCLUDEEM23ONDEMAND :\
                                            0x0UL)

/* Instance macros for I2C */
#define I2C(n)                             ( ((n)==0) ? I2C0 :\
                                            ((n)==1) ? I2C1 :\
                                            0x0UL)
#define I2C_NUM(ref)                       ( ((ref)==I2C0) ? 0 :\
                                            ((ref)==I2C1) ? 1 :\
                                            -1)
#define I2C_DELAY(n)                       ( ((n)==0) ? I2C0_DELAY :\
                                            ((n)==1) ? I2C1_DELAY :\
                                            0x0UL)
#define I2C_DELAY_CHAIN_NUM(n)             ( ((n)==0) ? I2C0_DELAY_CHAIN_NUM :\
                                            ((n)==1) ? I2C1_DELAY_CHAIN_NUM :\
                                            0x0UL)

